#include "Board.h"
#include "GPIO.h"
#include "Timer.h"

/************************************************************************************************************
** 函 数 名 : WdgInit
** 功能描述 : 看门狗初始化
** 输    入 : 无
** 输    出 : 无
** 返    回 :	无
*************************************************************************************************************
*/
void WdgInit(void)
{
	GpioSetDir(GPIO_WDI,OUTPUT);
}

/************************************************************************************************************
** 函 数 名 : WdgFeed
** 功能描述 : 写看门狗
** 输    入 : 无
** 输    出 : 无
** 返    回 :	无
*************************************************************************************************************
*/
void WdgFeed(void)
{
	static uint8_t dat32=0;
	static uint32_t timer;

	if (TimerRead() - timer > T10MS){
		timer = TimerRead();
		dat32++;
		if (dat32 % 2){
			GpioSetLev(GPIO_WDI,HIGH);
		}else{
			GpioSetLev(GPIO_WDI,LOW);
		}
	}
}

